; domain
(define (domain cell-assembly)
  (:requirements :strips :typing
		 :negative-preconditions
		 :action-costs)
  (:types arm		       ;
	  position	       ; Where the arms are potentially able to go
	  holdable
	  job - object
	  
	  table - position     ; The place to attach components with arms.
	  container - position ; Has infinite capacity to store things.
	  
	  conveyor - container ; Slide things in/away. Infinite length.
	  tray - container     ; Part trays.
	  
	  machine - table      ; Tables with specific feature (e.g. painting). Run jobs by itself.
	  machine-job - job    ; Jobs which should be done on machines.
	  base - holdable      ;
	  component - holdable ; Things which should be attatched on tables.
	  )
  (:constants carry-in - conveyor  ; the start of the base
	      carry-out - conveyor ; the goal of the base
	      table-in - table	   ; always connected to the conveyor
	      table-out - table	   ; always connected to the conveyor
	      nothing-done - job)  ; general start state of any base
  (:predicates 

   ;; arm attributes
   (reachable ?arm - arm ?to - position)
   ;; position attributes
   (connected ?from ?to - position) ;; by conveyor
   ;; job attributes
   (depends ?prev-job ?job - job)
   (job-available-at ?job - job ?pos - table)
   (uses ?job - job ?component - component)
   
   ;; state description
   (at ?obj - object ?pos - position)
   (arm-present ?pos - position)
   (base-present ?pos - position)
   
   (hold ?arm - arm ?holdable - holdable)
   (free ?arm - arm) ;; instead of (not (exists (?base) (hold ?arm ?base)))

   ;; (used ?component - component)
   
   (finished ?job - job ?base - base))

  (:functions
   (total-cost)
   (loading-cost)        ; the cost to set and eject base
   (job-cost ?job - job) ; the cost to do each job
   ;; NOTE: slidng a base is zero-cost
   (move-cost ?from ?to - position) - number)

  (:action move-arm
           ;; Moves the arm (?arm) from the source (?from) to the destination
           ;; (?to). The not-arm-present propositions enforce a mutual exclusion
           ;; constraint so that only one arm can occupy any given location at a
           ;; time.
	   :parameters (?arm - arm ?from - position ?to - position)
	   :precondition (and (at ?arm ?from)
			      (not (arm-present ?to))
			      (free ?arm)
			      (reachable ?arm ?to))
	   :effect (and (at ?arm ?to)
			(arm-present ?to)
			(not (at ?arm ?from))
			(not (arm-present ?from))
			(increase (total-cost) (move-cost ?from ?to))))

  (:action move-arm-holding
           ;; Same as move-arm, but assumes the arm is holding something.
	   :parameters (?arm - arm
		        ?from - position ?to - position
			?thing - holdable)
	   :precondition (and (at ?arm ?from)
			      (not (arm-present ?to))
			      (hold ?arm ?thing)
			      (reachable ?arm ?to))
	   :effect (and (at ?arm ?to)
			(arm-present ?to)
			(not (at ?arm ?from))
			(not (arm-present ?from))
			(increase (total-cost) (move-cost ?from ?to))))
  
  (:action eject-base
           ;; Eject Base: Uses an arm (?arm) to grasp and pick up a base (?base)
           ;; from a machine or a table (?pos). Resets the mutual exclusion
           ;; constraint on the table (not-base-present ?pos).
	   :parameters (?base - base ?arm - arm ?pos - table)
	   :precondition (and (at ?base ?pos)
			      (at ?arm ?pos)
			      (free ?arm))
	   :effect (and (hold ?arm ?base)
			(not (free ?arm))
			(not (base-present ?pos))
			(not (at ?base ?pos))
			(increase (total-cost) (loading-cost))))
  
  (:action set-base
           ;; Set Base: Commands an arm (?arm) that is holding a
           ;; particular base (?base) to set the base on a machine or
           ;; table (?pos). Sets the mutual exclusion constraint
           ;; (not-base-present ?pos).
	   :parameters (?base - base ?arm - arm ?pos - table)
	   :precondition (and (hold ?arm ?base)
			      (at ?arm ?pos)
			      (not (base-present ?pos)))
	   :effect (and (at ?base ?pos)
			(free ?arm)
			(not (hold ?arm ?base))
			(base-present ?pos)
			(increase (total-cost) (loading-cost))))

  (:action slide-base-in
           ;; Slide Base: Uses a slide device to move a base.
           ;; CARRY-IN device only.
           ;; It cares if the destination is already used.
	   :parameters (?base - base ?from - conveyor ?to - table)
	   :precondition (and (at ?base ?from)
			      (connected ?from ?to)
			      (not (base-present ?to)))
	   :effect (and (at ?base ?to)
			(not (at ?base ?from))
			(base-present ?to)
			(increase (total-cost) (loading-cost))))

  (:action slide-base-out
           ;; Slide Base: Uses a slide device to move a base. 
           ;; CARRY-OUT device only.
           ;; It doesn't care if the destination is already used.
           ;; After the action the base acts like it had disappeared.
	   :parameters (?base - base ?from - table ?to - conveyor)
	   :precondition (and (at ?base ?from)
			      (connected ?from ?to))
	   :effect (and (at ?base ?to)
			(not (at ?base ?from))
			(not (base-present ?from))
			(increase (total-cost) (loading-cost))))
  
  (:action pickup-component
           ;; Use an arm (?arm) to pick up a part (?part). The part will later be
           ;; used by assemble-with-arm.  NOTE: We assume there are unlimited
           ;; number of components in trays. That's why this action lacks the
           ;; delete effect on the place of the component (i.e. (not (at ?component
           ;; ?pos))).
	   :parameters (?component - component ?arm - arm ?pos - tray)
	   :precondition (and (free ?arm)
			      (at ?arm ?pos)
			      (at ?component ?pos))
	   :effect (and (hold ?arm ?component)
			(not (free ?arm))
			(increase (total-cost) (loading-cost))))
  
  (:action assemble-with-machine
           ;; Use a machine (?pos) to perform an assembly operation (e.g.,
           ;; tighten the screw, paint the base etc) on a base (?base).
           ;; The target base should fulfill some ordering constraints, e.g.
           ;; a base should be painted after a component X is attatched.

           ;; The ordering constraints are given in the problem.  This assumption
           ;; is realistic because when a product is designed, the designer always
           ;; considers how they are assembled.
	   :parameters (?base - base
			?machine - machine
			?job - machine-job
			?prev-job - job)
	   :precondition (and ;; machine specification
			  (job-available-at ?job ?machine)
			  ;; state specification
			  (not (finished ?job ?base))
			  (at ?base ?machine)
			  ;; job dependency specification (linear)
			  (depends ?prev-job ?job)
			  (finished ?prev-job ?base))
	   :effect (and (finished ?job ?base)
			(increase (total-cost) (job-cost ?job))))

  (:action assemble-with-arm
           ;; Uses an arm (?arm) to attach a part (?component) to a base.  This
           ;; operation should be done on a table.
	   :parameters (?component - component
			?job ?prev-job - job
			?base - base
			?arm - arm
			?pos - table)
	   :precondition (and
			  ;; job specification
			  (job-available-at ?job ?pos)
			  (uses ?job ?component)
			  ;; state specification
			  (hold ?arm ?component)
			  (at ?arm ?pos)
			  (at ?base ?pos)
			  ;; job dependency specification (linear)
			  (depends ?prev-job ?job)
			  (finished ?prev-job ?base))
	   :effect (and (finished ?job ?base)
			(free ?arm)
			(not (hold ?arm ?component))
			(increase (total-cost) (job-cost ?job)))))

; problem
(DEFINE (PROBLEM CELL-ASSEMBLY-MODEL2A-1) (:DOMAIN CELL-ASSEMBLY)
 (:OBJECTS ARM1 ARM2 - ARM B-0 - BASE PART-A PART-B PART-C - COMPONENT TRAY-A
  TRAY-B TRAY-C - TRAY TABLE1 TABLE2 - TABLE GASKET-MACHINE SCREW-MACHINE-A
  OILING-MACHINE SCREW-MACHINE-C INSPECTION-MACHINE - MACHINE INSERT-GASKET -
  MACHINE-JOB ATTATCH-A - JOB SCREW-A - MACHINE-JOB OIL-CYLINDER - MACHINE-JOB
  ATTATCH-B - JOB ATTATCH-C - JOB SCREW-C - MACHINE-JOB INSPECT-BASE -
  MACHINE-JOB)
 (:INIT (= (TOTAL-COST) 0) (= (LOADING-COST) 1) (REACHABLE ARM1 GASKET-MACHINE)
  (REACHABLE ARM1 INSPECTION-MACHINE) (REACHABLE ARM1 TABLE-IN)
  (REACHABLE ARM1 TABLE-OUT) (REACHABLE ARM1 TABLE1) (REACHABLE ARM1 TABLE2)
  (REACHABLE ARM1 TRAY-A) (REACHABLE ARM2 SCREW-MACHINE-A)
  (REACHABLE ARM2 OILING-MACHINE) (REACHABLE ARM2 SCREW-MACHINE-C)
  (REACHABLE ARM2 TABLE1) (REACHABLE ARM2 TABLE2) (REACHABLE ARM2 TRAY-B)
  (REACHABLE ARM2 TRAY-C) (= (MOVE-COST GASKET-MACHINE GASKET-MACHINE) 1000)
  (= (MOVE-COST GASKET-MACHINE TABLE1) 2)
  (= (MOVE-COST GASKET-MACHINE SCREW-MACHINE-A) 3)
  (= (MOVE-COST GASKET-MACHINE TRAY-B) 4)
  (= (MOVE-COST GASKET-MACHINE OILING-MACHINE) 5)
  (= (MOVE-COST GASKET-MACHINE TRAY-C) 6)
  (= (MOVE-COST GASKET-MACHINE SCREW-MACHINE-C) 7)
  (= (MOVE-COST GASKET-MACHINE TABLE2) 6)
  (= (MOVE-COST GASKET-MACHINE INSPECTION-MACHINE) 5)
  (= (MOVE-COST GASKET-MACHINE TABLE-OUT) 4)
  (= (MOVE-COST GASKET-MACHINE TRAY-A) 3)
  (= (MOVE-COST GASKET-MACHINE TABLE-IN) 2)
  (= (MOVE-COST TABLE1 GASKET-MACHINE) 2) (= (MOVE-COST TABLE1 TABLE1) 1000)
  (= (MOVE-COST TABLE1 SCREW-MACHINE-A) 2) (= (MOVE-COST TABLE1 TRAY-B) 3)
  (= (MOVE-COST TABLE1 OILING-MACHINE) 4) (= (MOVE-COST TABLE1 TRAY-C) 5)
  (= (MOVE-COST TABLE1 SCREW-MACHINE-C) 6) (= (MOVE-COST TABLE1 TABLE2) 7)
  (= (MOVE-COST TABLE1 INSPECTION-MACHINE) 6)
  (= (MOVE-COST TABLE1 TABLE-OUT) 5) (= (MOVE-COST TABLE1 TRAY-A) 4)
  (= (MOVE-COST TABLE1 TABLE-IN) 3)
  (= (MOVE-COST SCREW-MACHINE-A GASKET-MACHINE) 3)
  (= (MOVE-COST SCREW-MACHINE-A TABLE1) 2)
  (= (MOVE-COST SCREW-MACHINE-A SCREW-MACHINE-A) 1000)
  (= (MOVE-COST SCREW-MACHINE-A TRAY-B) 2)
  (= (MOVE-COST SCREW-MACHINE-A OILING-MACHINE) 3)
  (= (MOVE-COST SCREW-MACHINE-A TRAY-C) 4)
  (= (MOVE-COST SCREW-MACHINE-A SCREW-MACHINE-C) 5)
  (= (MOVE-COST SCREW-MACHINE-A TABLE2) 6)
  (= (MOVE-COST SCREW-MACHINE-A INSPECTION-MACHINE) 7)
  (= (MOVE-COST SCREW-MACHINE-A TABLE-OUT) 6)
  (= (MOVE-COST SCREW-MACHINE-A TRAY-A) 5)
  (= (MOVE-COST SCREW-MACHINE-A TABLE-IN) 4)
  (= (MOVE-COST TRAY-B GASKET-MACHINE) 4) (= (MOVE-COST TRAY-B TABLE1) 3)
  (= (MOVE-COST TRAY-B SCREW-MACHINE-A) 2) (= (MOVE-COST TRAY-B TRAY-B) 1000)
  (= (MOVE-COST TRAY-B OILING-MACHINE) 2) (= (MOVE-COST TRAY-B TRAY-C) 3)
  (= (MOVE-COST TRAY-B SCREW-MACHINE-C) 4) (= (MOVE-COST TRAY-B TABLE2) 5)
  (= (MOVE-COST TRAY-B INSPECTION-MACHINE) 6)
  (= (MOVE-COST TRAY-B TABLE-OUT) 7) (= (MOVE-COST TRAY-B TRAY-A) 6)
  (= (MOVE-COST TRAY-B TABLE-IN) 5)
  (= (MOVE-COST OILING-MACHINE GASKET-MACHINE) 5)
  (= (MOVE-COST OILING-MACHINE TABLE1) 4)
  (= (MOVE-COST OILING-MACHINE SCREW-MACHINE-A) 3)
  (= (MOVE-COST OILING-MACHINE TRAY-B) 2)
  (= (MOVE-COST OILING-MACHINE OILING-MACHINE) 1000)
  (= (MOVE-COST OILING-MACHINE TRAY-C) 2)
  (= (MOVE-COST OILING-MACHINE SCREW-MACHINE-C) 3)
  (= (MOVE-COST OILING-MACHINE TABLE2) 4)
  (= (MOVE-COST OILING-MACHINE INSPECTION-MACHINE) 5)
  (= (MOVE-COST OILING-MACHINE TABLE-OUT) 6)
  (= (MOVE-COST OILING-MACHINE TRAY-A) 7)
  (= (MOVE-COST OILING-MACHINE TABLE-IN) 6)
  (= (MOVE-COST TRAY-C GASKET-MACHINE) 6) (= (MOVE-COST TRAY-C TABLE1) 5)
  (= (MOVE-COST TRAY-C SCREW-MACHINE-A) 4) (= (MOVE-COST TRAY-C TRAY-B) 3)
  (= (MOVE-COST TRAY-C OILING-MACHINE) 2) (= (MOVE-COST TRAY-C TRAY-C) 1000)
  (= (MOVE-COST TRAY-C SCREW-MACHINE-C) 2) (= (MOVE-COST TRAY-C TABLE2) 3)
  (= (MOVE-COST TRAY-C INSPECTION-MACHINE) 4)
  (= (MOVE-COST TRAY-C TABLE-OUT) 5) (= (MOVE-COST TRAY-C TRAY-A) 6)
  (= (MOVE-COST TRAY-C TABLE-IN) 7)
  (= (MOVE-COST SCREW-MACHINE-C GASKET-MACHINE) 7)
  (= (MOVE-COST SCREW-MACHINE-C TABLE1) 6)
  (= (MOVE-COST SCREW-MACHINE-C SCREW-MACHINE-A) 5)
  (= (MOVE-COST SCREW-MACHINE-C TRAY-B) 4)
  (= (MOVE-COST SCREW-MACHINE-C OILING-MACHINE) 3)
  (= (MOVE-COST SCREW-MACHINE-C TRAY-C) 2)
  (= (MOVE-COST SCREW-MACHINE-C SCREW-MACHINE-C) 1000)
  (= (MOVE-COST SCREW-MACHINE-C TABLE2) 2)
  (= (MOVE-COST SCREW-MACHINE-C INSPECTION-MACHINE) 3)
  (= (MOVE-COST SCREW-MACHINE-C TABLE-OUT) 4)
  (= (MOVE-COST SCREW-MACHINE-C TRAY-A) 5)
  (= (MOVE-COST SCREW-MACHINE-C TABLE-IN) 6)
  (= (MOVE-COST TABLE2 GASKET-MACHINE) 6) (= (MOVE-COST TABLE2 TABLE1) 7)
  (= (MOVE-COST TABLE2 SCREW-MACHINE-A) 6) (= (MOVE-COST TABLE2 TRAY-B) 5)
  (= (MOVE-COST TABLE2 OILING-MACHINE) 4) (= (MOVE-COST TABLE2 TRAY-C) 3)
  (= (MOVE-COST TABLE2 SCREW-MACHINE-C) 2) (= (MOVE-COST TABLE2 TABLE2) 1000)
  (= (MOVE-COST TABLE2 INSPECTION-MACHINE) 2)
  (= (MOVE-COST TABLE2 TABLE-OUT) 3) (= (MOVE-COST TABLE2 TRAY-A) 4)
  (= (MOVE-COST TABLE2 TABLE-IN) 5)
  (= (MOVE-COST INSPECTION-MACHINE GASKET-MACHINE) 5)
  (= (MOVE-COST INSPECTION-MACHINE TABLE1) 6)
  (= (MOVE-COST INSPECTION-MACHINE SCREW-MACHINE-A) 7)
  (= (MOVE-COST INSPECTION-MACHINE TRAY-B) 6)
  (= (MOVE-COST INSPECTION-MACHINE OILING-MACHINE) 5)
  (= (MOVE-COST INSPECTION-MACHINE TRAY-C) 4)
  (= (MOVE-COST INSPECTION-MACHINE SCREW-MACHINE-C) 3)
  (= (MOVE-COST INSPECTION-MACHINE TABLE2) 2)
  (= (MOVE-COST INSPECTION-MACHINE INSPECTION-MACHINE) 1000)
  (= (MOVE-COST INSPECTION-MACHINE TABLE-OUT) 2)
  (= (MOVE-COST INSPECTION-MACHINE TRAY-A) 3)
  (= (MOVE-COST INSPECTION-MACHINE TABLE-IN) 4)
  (= (MOVE-COST TABLE-OUT GASKET-MACHINE) 4) (= (MOVE-COST TABLE-OUT TABLE1) 5)
  (= (MOVE-COST TABLE-OUT SCREW-MACHINE-A) 6)
  (= (MOVE-COST TABLE-OUT TRAY-B) 7) (= (MOVE-COST TABLE-OUT OILING-MACHINE) 6)
  (= (MOVE-COST TABLE-OUT TRAY-C) 5)
  (= (MOVE-COST TABLE-OUT SCREW-MACHINE-C) 4)
  (= (MOVE-COST TABLE-OUT TABLE2) 3)
  (= (MOVE-COST TABLE-OUT INSPECTION-MACHINE) 2)
  (= (MOVE-COST TABLE-OUT TABLE-OUT) 1000) (= (MOVE-COST TABLE-OUT TRAY-A) 2)
  (= (MOVE-COST TABLE-OUT TABLE-IN) 3) (= (MOVE-COST TRAY-A GASKET-MACHINE) 3)
  (= (MOVE-COST TRAY-A TABLE1) 4) (= (MOVE-COST TRAY-A SCREW-MACHINE-A) 5)
  (= (MOVE-COST TRAY-A TRAY-B) 6) (= (MOVE-COST TRAY-A OILING-MACHINE) 7)
  (= (MOVE-COST TRAY-A TRAY-C) 6) (= (MOVE-COST TRAY-A SCREW-MACHINE-C) 5)
  (= (MOVE-COST TRAY-A TABLE2) 4) (= (MOVE-COST TRAY-A INSPECTION-MACHINE) 3)
  (= (MOVE-COST TRAY-A TABLE-OUT) 2) (= (MOVE-COST TRAY-A TRAY-A) 1000)
  (= (MOVE-COST TRAY-A TABLE-IN) 2) (= (MOVE-COST TABLE-IN GASKET-MACHINE) 2)
  (= (MOVE-COST TABLE-IN TABLE1) 3) (= (MOVE-COST TABLE-IN SCREW-MACHINE-A) 4)
  (= (MOVE-COST TABLE-IN TRAY-B) 5) (= (MOVE-COST TABLE-IN OILING-MACHINE) 6)
  (= (MOVE-COST TABLE-IN TRAY-C) 7) (= (MOVE-COST TABLE-IN SCREW-MACHINE-C) 6)
  (= (MOVE-COST TABLE-IN TABLE2) 5)
  (= (MOVE-COST TABLE-IN INSPECTION-MACHINE) 4)
  (= (MOVE-COST TABLE-IN TABLE-OUT) 3) (= (MOVE-COST TABLE-IN TRAY-A) 2)
  (= (MOVE-COST TABLE-IN TABLE-IN) 1000) (CONNECTED CARRY-IN TABLE-IN)
  (CONNECTED TABLE-OUT CARRY-OUT) (= (JOB-COST INSPECT-BASE) 3)
  (DEPENDS SCREW-C INSPECT-BASE)
  (JOB-AVAILABLE-AT INSPECT-BASE INSPECTION-MACHINE) (= (JOB-COST SCREW-C) 2)
  (DEPENDS ATTATCH-C SCREW-C) (JOB-AVAILABLE-AT SCREW-C SCREW-MACHINE-C)
  (AT PART-C TRAY-C) (USES ATTATCH-C PART-C) (= (JOB-COST ATTATCH-C) 3)
  (DEPENDS ATTATCH-B ATTATCH-C) (JOB-AVAILABLE-AT ATTATCH-C TABLE2)
  (AT PART-B TRAY-B) (USES ATTATCH-B PART-B) (= (JOB-COST ATTATCH-B) 3)
  (DEPENDS OIL-CYLINDER ATTATCH-B) (JOB-AVAILABLE-AT ATTATCH-B TABLE2)
  (= (JOB-COST OIL-CYLINDER) 2) (DEPENDS SCREW-A OIL-CYLINDER)
  (JOB-AVAILABLE-AT OIL-CYLINDER OILING-MACHINE) (= (JOB-COST SCREW-A) 3)
  (DEPENDS ATTATCH-A SCREW-A) (JOB-AVAILABLE-AT SCREW-A SCREW-MACHINE-A)
  (AT PART-A TRAY-A) (USES ATTATCH-A PART-A) (= (JOB-COST ATTATCH-A) 3)
  (DEPENDS INSERT-GASKET ATTATCH-A) (JOB-AVAILABLE-AT ATTATCH-A TABLE1)
  (= (JOB-COST INSERT-GASKET) 3) (DEPENDS NOTHING-DONE INSERT-GASKET)
  (JOB-AVAILABLE-AT INSERT-GASKET GASKET-MACHINE) (= (JOB-COST NOTHING-DONE) 0)
  (AT B-0 CARRY-IN) (FINISHED NOTHING-DONE B-0) (FREE ARM1) (AT ARM1 TRAY-A)
  (ARM-PRESENT TRAY-A) (FREE ARM2) (AT ARM2 OILING-MACHINE)
  (ARM-PRESENT OILING-MACHINE))
 (:GOAL (AND (AT B-0 CARRY-OUT) (FINISHED INSPECT-BASE B-0)))
 (:METRIC MINIMIZE (TOTAL-COST)))

; plan
1. (slide-base-in b-0 carry-in table-in)
   deleted: (at b-0 carry-in)
   added: (at b-0 table-in) (base-present table-in)
   goals met: 0 of 2
2. (move-arm arm1 tray-a table-in)
   deleted: (at arm1 tray-a) (arm-present tray-a)
   added: (at arm1 table-in) (arm-present table-in)
   goals met: 0 of 2
3. (eject-base b-0 arm1 table-in)
   deleted: (free arm1) (base-present table-in) (at b-0 table-in)
   added: (hold arm1 b-0)
   goals met: 0 of 2
4. (move-arm-holding arm1 table-in gasket-machine b-0)
   deleted: (at arm1 table-in) (arm-present table-in)
   added: (at arm1 gasket-machine) (arm-present gasket-machine)
   goals met: 0 of 2
5. (set-base b-0 arm1 gasket-machine)
   deleted: (hold arm1 b-0)
   added: (at b-0 gasket-machine) (free arm1) (base-present gasket-machine)
   goals met: 0 of 2
6. (assemble-with-machine b-0 gasket-machine insert-gasket nothing-done)
   added: (finished insert-gasket b-0)
   goals met: 0 of 2
7. (eject-base b-0 arm1 gasket-machine)
   deleted: (free arm1) (base-present gasket-machine) (at b-0 gasket-machine)
   added: (hold arm1 b-0)
   goals met: 0 of 2
8. (move-arm-holding arm1 gasket-machine table1 b-0)
   deleted: (at arm1 gasket-machine) (arm-present gasket-machine)
   added: (at arm1 table1) (arm-present table1)
   goals met: 0 of 2
9. (set-base b-0 arm1 table1)
   deleted: (hold arm1 b-0)
   added: (at b-0 table1) (free arm1) (base-present table1)
   goals met: 0 of 2
10. (move-arm arm1 table1 tray-a)
   deleted: (at arm1 table1) (arm-present table1)
   added: (at arm1 tray-a) (arm-present tray-a)
   goals met: 0 of 2
11. (pickup-component part-a arm1 tray-a)
   deleted: (free arm1)
   added: (hold arm1 part-a)
   goals met: 0 of 2
12. (move-arm-holding arm1 tray-a table1 part-a)
   deleted: (at arm1 tray-a) (arm-present tray-a)
   added: (at arm1 table1) (arm-present table1)
   goals met: 0 of 2
13. (assemble-with-arm part-a attatch-a insert-gasket b-0 arm1 table1)
   deleted: (hold arm1 part-a)
   added: (finished attatch-a b-0) (free arm1)
   goals met: 0 of 2
14. (move-arm arm1 table1 table-out)
   deleted: (at arm1 table1) (arm-present table1)
   added: (at arm1 table-out) (arm-present table-out)
   goals met: 0 of 2
15. (move-arm arm2 oiling-machine table1)
   deleted: (at arm2 oiling-machine) (arm-present oiling-machine)
   added: (at arm2 table1) (arm-present table1)
   goals met: 0 of 2
16. (eject-base b-0 arm2 table1)
   deleted: (free arm2) (base-present table1) (at b-0 table1)
   added: (hold arm2 b-0)
   goals met: 0 of 2
17. (move-arm-holding arm2 table1 screw-machine-a b-0)
   deleted: (at arm2 table1) (arm-present table1)
   added: (at arm2 screw-machine-a) (arm-present screw-machine-a)
   goals met: 0 of 2
18. (set-base b-0 arm2 screw-machine-a)
   deleted: (hold arm2 b-0)
   added: (at b-0 screw-machine-a) (free arm2) (base-present screw-machine-a)
   goals met: 0 of 2
19. (assemble-with-machine b-0 screw-machine-a screw-a attatch-a)
   added: (finished screw-a b-0)
   goals met: 0 of 2
20. (eject-base b-0 arm2 screw-machine-a)
   deleted: (free arm2) (base-present screw-machine-a) (at b-0 screw-machine-a)
   added: (hold arm2 b-0)
   goals met: 0 of 2
21. (move-arm-holding arm2 screw-machine-a oiling-machine b-0)
   deleted: (at arm2 screw-machine-a) (arm-present screw-machine-a)
   added: (at arm2 oiling-machine) (arm-present oiling-machine)
   goals met: 0 of 2
22. (set-base b-0 arm2 oiling-machine)
   deleted: (hold arm2 b-0)
   added: (at b-0 oiling-machine) (free arm2) (base-present oiling-machine)
   goals met: 0 of 2
23. (assemble-with-machine b-0 oiling-machine oil-cylinder screw-a)
   added: (finished oil-cylinder b-0)
   goals met: 0 of 2
24. (eject-base b-0 arm2 oiling-machine)
   deleted: (free arm2) (base-present oiling-machine) (at b-0 oiling-machine)
   added: (hold arm2 b-0)
   goals met: 0 of 2
25. (move-arm-holding arm2 oiling-machine table2 b-0)
   deleted: (at arm2 oiling-machine) (arm-present oiling-machine)
   added: (at arm2 table2) (arm-present table2)
   goals met: 0 of 2
26. (set-base b-0 arm2 table2)
   deleted: (hold arm2 b-0)
   added: (at b-0 table2) (free arm2) (base-present table2)
   goals met: 0 of 2
27. (move-arm arm2 table2 tray-b)
   deleted: (at arm2 table2) (arm-present table2)
   added: (at arm2 tray-b) (arm-present tray-b)
   goals met: 0 of 2
28. (pickup-component part-b arm2 tray-b)
   deleted: (free arm2)
   added: (hold arm2 part-b)
   goals met: 0 of 2
29. (move-arm-holding arm2 tray-b table2 part-b)
   deleted: (at arm2 tray-b) (arm-present tray-b)
   added: (at arm2 table2) (arm-present table2)
   goals met: 0 of 2
30. (assemble-with-arm part-b attatch-b oil-cylinder b-0 arm2 table2)
   deleted: (hold arm2 part-b)
   added: (finished attatch-b b-0) (free arm2)
   goals met: 0 of 2
31. (move-arm arm2 table2 tray-c)
   deleted: (at arm2 table2) (arm-present table2)
   added: (at arm2 tray-c) (arm-present tray-c)
   goals met: 0 of 2
32. (pickup-component part-c arm2 tray-c)
   deleted: (free arm2)
   added: (hold arm2 part-c)
   goals met: 0 of 2
33. (move-arm-holding arm2 tray-c table2 part-c)
   deleted: (at arm2 tray-c) (arm-present tray-c)
   added: (at arm2 table2) (arm-present table2)
   goals met: 0 of 2
34. (assemble-with-arm part-c attatch-c attatch-b b-0 arm2 table2)
   deleted: (hold arm2 part-c)
   added: (finished attatch-c b-0) (free arm2)
   goals met: 0 of 2
35. (eject-base b-0 arm2 table2)
   deleted: (free arm2) (base-present table2) (at b-0 table2)
   added: (hold arm2 b-0)
   goals met: 0 of 2
36. (move-arm-holding arm2 table2 screw-machine-c b-0)
   deleted: (at arm2 table2) (arm-present table2)
   added: (at arm2 screw-machine-c) (arm-present screw-machine-c)
   goals met: 0 of 2
37. (set-base b-0 arm2 screw-machine-c)
   deleted: (hold arm2 b-0)
   added: (at b-0 screw-machine-c) (free arm2) (base-present screw-machine-c)
   goals met: 0 of 2
38. (assemble-with-machine b-0 screw-machine-c screw-c attatch-c)
   added: (finished screw-c b-0)
   goals met: 0 of 2
39. (eject-base b-0 arm2 screw-machine-c)
   deleted: (free arm2) (base-present screw-machine-c) (at b-0 screw-machine-c)
   added: (hold arm2 b-0)
   goals met: 0 of 2
40. (move-arm-holding arm2 screw-machine-c table2 b-0)
   deleted: (at arm2 screw-machine-c) (arm-present screw-machine-c)
   added: (at arm2 table2) (arm-present table2)
   goals met: 0 of 2
41. (set-base b-0 arm2 table2)
   deleted: (hold arm2 b-0)
   added: (at b-0 table2) (free arm2) (base-present table2)
   goals met: 0 of 2
42. (move-arm arm2 table2 screw-machine-c)
   deleted: (at arm2 table2) (arm-present table2)
   added: (at arm2 screw-machine-c) (arm-present screw-machine-c)
   goals met: 0 of 2
43. (move-arm arm1 table-out table2)
   deleted: (at arm1 table-out) (arm-present table-out)
   added: (at arm1 table2) (arm-present table2)
   goals met: 0 of 2
44. (eject-base b-0 arm1 table2)
   deleted: (free arm1) (base-present table2) (at b-0 table2)
   added: (hold arm1 b-0)
   goals met: 0 of 2
45. (move-arm-holding arm1 table2 inspection-machine b-0)
   deleted: (at arm1 table2) (arm-present table2)
   added: (at arm1 inspection-machine) (arm-present inspection-machine)
   goals met: 0 of 2
46. (set-base b-0 arm1 inspection-machine)
   deleted: (hold arm1 b-0)
   added: (at b-0 inspection-machine) (free arm1) (base-present inspection-machine)
   goals met: 0 of 2
47. (assemble-with-machine b-0 inspection-machine inspect-base screw-c)
   added: (finished inspect-base b-0)
   goals met: 1 of 2
48. (eject-base b-0 arm1 inspection-machine)
   deleted: (free arm1) (base-present inspection-machine) (at b-0 inspection-machine)
   added: (hold arm1 b-0)
   goals met: 1 of 2
49. (move-arm-holding arm1 inspection-machine table-out b-0)
   deleted: (at arm1 inspection-machine) (arm-present inspection-machine)
   added: (at arm1 table-out) (arm-present table-out)
   goals met: 1 of 2
50. (set-base b-0 arm1 table-out)
   deleted: (hold arm1 b-0)
   added: (at b-0 table-out) (free arm1) (base-present table-out)
   goals met: 1 of 2
51. (slide-base-out b-0 table-out carry-out)
   deleted: (at b-0 table-out) (base-present table-out)
   added: (at b-0 carry-out)
   goals met: 2 of 2
